app/interactions/dog/create_intr.rb

SELECT "dogs".* FROM "dogs" WHERE "dogs"."breed" = $1 LIMIT $2  [["breed", "hound"], ["LIMIT", 1]]
INSERT INTO "dogs" ("breed", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["breed", "hound"], ["created_at", "2024-01-25 12:45:49.959819"], ["updated_at", "2024-01-25 12:45:49.959819"]]
INSERT INTO "images" ("dog_id", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dog_id", 1], ["url", "https://images.dog.ceo/breeds/hound-basset/n02088238_10113.jpg"], ["created_at", "2024-01-25 12:45:49.962252"], ["updated_at", "2024-01-25 12:45:49.962252"]]
---
  def execute
    dog = Dog.find_or_initialize_by(breed: inputs[:breed])
    dog.images.build(url: inputs[:image])

    unless dog.save